---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWelded.TopFlangeWidth
source: html/31e512fc-8bbe-2ea5-d8aa-39a3fd3afa7c.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWelded.TopFlangeWidth Property

Top Flange Width.

## Syntax (C#)
```csharp
public double TopFlangeWidth { get; set; }
```